package 다리건너기게임;

import java.util.Random;
import java.util.Scanner;

public class 다리건너기구현해볼까요 { 

	public static void main(String[] args) {
		Random rd = new Random();
		Scanner sc = new Scanner(System.in);

		System.out.println("네번째 게임은 다리 건너기 게임입니다. \n" + "맞춤법이 맞는 단어들을 입력해 다리를 건너면 성공입니다. \n"
				+ "맞춤법이 틀린 당신은 한국에서 살아갈 수 없습니다... 안녕....\n" + "당신이 건너야 할 다리를 보여드리겠습니다. 총 7개의 발판을 건너야 합니다. \n"
				+ "Good Luck\n");

		System.out
				.println("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n"
						+ "                                                                                          \n"
						+ "                                                                                          \n"
						+ "$$$$$$$$$$$  $$$$$$$$$$$  $$$$$$$$$$$ $$$$$$$$$$$  $$$$$$$$$$$  $$$$$$$$$$$ $$$$$$$$$$$   \n"
						+ "$         $  $         $  $         $ $         $  $         $  $         $ $         $  \n"
						+ "$         $  $         $  $         $ $         $  $         $  $         $ $         $ \n"
						+ "$         $  $         $  $         $ $         $  $         $  $         $ $         $   \n"
						+ "$         $  $         $  $         $ $         $  $         $  $         $ $         $   \n"
						+ "$         $  $         $  $         $ $         $  $         $  $         $ $         $   \n"
						+ "$$$$$$$$$$$  $$$$$$$$$$$  $$$$$$$$$$$ $$$$$$$$$$$  $$$$$$$$$$$  $$$$$$$$$$$ $$$$$$$$$$$    \n"
						+ "\n" + "\n" + "\n"
						+ "$$$$$$$$$$$  $$$$$$$$$$$  $$$$$$$$$$$ $$$$$$$$$$$  $$$$$$$$$$$  $$$$$$$$$$$ $$$$$$$$$$$   \n"
						+ "$         $  $         $  $         $ $         $  $         $  $         $ $         $  \n"
						+ "$         $  $         $  $         $ $         $  $         $  $         $ $         $ \n"
						+ "$         $  $         $  $         $ $         $  $         $  $         $ $         $   \n"
						+ "$         $  $         $  $         $ $         $  $         $  $         $ $         $   \n"
						+ "$         $  $         $  $         $ $         $  $         $  $         $ $         $   \n"
						+ "$$$$$$$$$$$  $$$$$$$$$$$  $$$$$$$$$$$ $$$$$$$$$$$  $$$$$$$$$$$  $$$$$$$$$$$ $$$$$$$$$$$    \n"
						+ "\n" + "\n"
						+ "@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@");

		String[][] korean = { { "희안하다", "희한하다" }, { "건들이다", "건드리다" }, { "뒤치닥거리", "뒤치다꺼리" }, { "금새", "금세" },
				{ "오랫만에", "오랜만에" }, { "달디달다", "다디달다" }, { "우유곽", "우유갑" }, { "낼름", "날름" }, { "눈꼽", "눈곱" },
				{ "곰곰히", "곰곰이" }, { "안되", "안돼" }, { "역활", "역할" }, { "육계장", "육개장" }, { "바램", "바람" },
				{ "몇일", "며칠" }, { "빈털털이", "빈털터리" }, { "구렛나루", "구렛나룻" }, { "깨끗이", "깨끗히" }, { "괴자번호", "계좌번호" },
				{ "일해라절해라", "이래라저래라" } };
		
		

		System.out.println("맞춤법이 맞는 단어를 입력해주세요\n");

		int[] printArr = new int[7];

		for (int i = 0; i < printArr.length; i++) {
			printArr[i] = rd.nextInt(20);
			for (int j = 0; j < i; j++) {
				if (printArr[i] == printArr[j]) {
					i--;
					break;
				}
			}
		}
		int i =0;
		int chance = 7;
		boolean isRunning = true;
		while (chance != 0 && isRunning) {
			System.out.println();
			System.out.println("문제 입니다 >> " + korean[printArr[chance - 1]][0] + " or " + korean[printArr[chance - 1]][1]);
			System.out.print("단어를 정확히 입력해주세요 >>");
			String answer = sc.next();

			System.out.println();
			if (korean[printArr[chance - 1]][1].equals(answer)) {
				if(chance != 1) {
					System.out.println(new 다리출력배열().success[i++]); 
					System.out.println("정답입니다.한 칸 전진하였습니다.\n");
					chance--;
				}else {
					System.out.println(new 다리출력배열().success[i++]); 
					System.out.println("다리건너기를 완료 하였습니다. 고생하셨습니다");
					break;
				}
			} else {
				System.out.println("수고 하셨습니다. 탈락.\n"
				+"		 ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡠⣄⡀⠀⠀⡠⠞⠛⢦⣠⢤⡀⠀\n"
				+"		⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⢠⠏⠀⠀⢱⡀⣸⠁⠀⡴⠋⠀⠀⣹⠀\n"
				+"		⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡴⠋⠉⢿⢀⡤⠶⣴⠇⣯⠀⣼⠁⠀⢀⡴⠷⣄ \n"
				+"		⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠞⠁⠀⣀⡾⠋⠀⠀⢹⣼⠁⢠⡇⠀⡴⠋⠀⠀⡼ \n"
				+"		⠀⠀⠀⠀⢠⠊⠑⢦⠀⡴⠋⢀⣠⠞⠉⠀⠀⠀⣠⣿⠧⣄⡾⠁⡼⠁⣀⣤⠾⡁\n"
				+"		⠀⠀⠀⠀⢸⠀⠀⣨⠟⠁⢠⡞⠁⠀⠀⠀⣠⡾⠛⠁⠀⣿⠃⣰⠃⣴⠋⠀⠀⣷\n"
				+"		⠀⠀⠀⠀⣸⢠⠞⠁⠀⢠⠏⠀⠀⢀⡴⠋⠁⠀⢀⣠⡴⠿⣶⡇⢰⠇⠀⠀⢠⠇\n"
				+"		⠀⠀⠀⢠⢿⠏⠀⠀⠀⠉⠀⠀⣠⠞⠁⠀⡴⠚⠉⠁⠀⢀⡟⠀⣼⠀⠀⠀⢸⠀\n"
				+"		⠀⠀⠀⡾⣼⢀⠀⠀⠀⠀⠀⠈⠉⠀⣠⠞⠁⠀⠀⢀⡴⠋⠙⢼⠃⠀⠀⠀⣸⠀\n"
				+"		⠀⠀⠀⡇⠉⡎⠀⣰⠃⠀⠀⠀⠀⠀⠁⠀⠀⠀⡼⠉⠀⠀⠀⠘⠂⠀⠀⣠⠇⠀\n"
				+"		⠀⠀⠀⡇⢸⠀⣰⠃⠀⡴⠀⠀⠀⠀⠀⠀⣠⠞⠁⠀⠀⠀⠀⠀⠀⣠⠖⠁⠀⠀\n"
				+"		⠀⠀⢸⠁⡏⢠⠃⢀⠞⠀⠀⠀⠀⠀⠀⢸⠁⠀⠀⠀⠀⢀⣠⠖⠋⠁⠀⠀⠀⠀\n"
				+"		⠀⠀⡞⠀⠃⡎⢀⠏⠀⠀⠀⠀⠀⠀⢀⡏⠀⣀⡤⠴⠚⠉⠀⠀⠀⠀⠀⠀⠀⠀\n"
				+"		⡴⢺⠇⠀⠀⠀⠞⠀⠀⠀⠀⠀⠀⢀⡾⠒⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n"
				+"		⡇⠘⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n"
				+"		⢳⡀⠘⢦⡀⠀⠀⠀⠀⠀⠀⡰⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n"
				+"		⠀⠳⣄⠀⠙⠲⣤⣀⣠⠴⠊⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n"
				+"		⠀⠀⠈⠓⠦⣄⣀⡠⠎⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n");
				isRunning = false;

			}

		}

	}
}
